Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: །སྡིག་ཏོ་ཟད་ཅིང་དགེ་ཆོས་རྣམ་པར་འཕེལ་འགྱུར་བའི།
en: He has the meditation of remaining in mindfulness that forsakes existence.

source: །ཡང་དག་སྤོང་བ་བཞི་ལ་འང་མཁས་པ་སྒོམ་པ་བྱེད།
en: “The wise ones cultivate the four eliminations. They have ended bad actions and increased good actions.

source: །རྫུ་འཕྲུལ་རྐང་པ་བཞི་དང་སྟོབས་དང་དབང་པོ་དང་། །བྱང་ཆུབ་ཡན་ལག་རིན་ཆེན་ལམ་རབ་ཡིད་འོང་སྒོམ།
en: They cultivate the four bases of miraculous powers, the powers , and the strengths, The shining jewels of the factors for enlightenment, and the superior path.

source: །དེ་དག་ཀུན་ཀྱང་འགྲོ་ལ་ལྟ་བའི་བློ་སྒོམ་སྟེ།
en: “They cultivate those while their minds regard beings,

source: །སྙིང་བརྩེ་བྱམས་པ་སྔོན་འགྲོ་སྨོན་ལམ་ཉེ་བར་རྟོན། །སྟོབས་ཀྱི་དམ་པ་གོ་འཕང་མཆོག་གི་རྗེས་སེམས་ཤིང་།
en: They have previously developed love and are supported by their previous prayers,

source: །ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་སངས་རྒྱས་ཞིང་ལ་སྨོན།
en: They aspire to omniscient wisdom and to buddha realms, And they contemplate the sublime strengths and the higher bhūmis. “ Unwavering , they aspire to gain the confidences of the Teacher,

source: །སྟོན་པའི་འཇིགས་མེད་རྣམས་དང་ཆོས་རྣམས་འཕྲོགས་མེད་དང་། སངས་རྒྱས་གསུང་གི་མཆོག་ལ་བརྟེན་པ་སྨོན་བྱེད་ཅིང་།
en: His insuperable qualities, and the supreme Buddha speech.

source: །རིན་ཆེན་ལམ་ཟབ་རྣམ་པར་ཐར་པའི་གནས་རྣམས་དང་། །ཆེ་བའི་ཐབས་རྣམས་ཡང་དག་བསྒྲུབ་ཕྱིར་བསྒོམ་པ་བྱེད།
en: They cultivate the attainment of the precious profound path, The state of liberation, and great methods.

source: །འཇིག་ཚོགས་ལྟ་མེད་ལྟ་བ་དྲུག་ཅུ་གཉིས་ཀྱང་མེད།
en: “They are free from the view of a self and from the sixty-two incorrect views,

source: །བདག་དང་བདག་གི་མེད་ཅིང་སྲོག་ཏུ་དམིགས་པ་མེད། །ཕུང་པོ་སྐྱེ་མཆེད་རྣམས་དང་ཁམས་ཀྱི་གནས་དང་རྟེན།
en: From the view of me or mine and the possession of a soul.

source: །ཀུན་ཀྱང་མཁས་པས་བཞི་པོའི་ས་ལ་རབ་ཏུ་སྤངས།
en: The wise ones on the fourth bhūmi have rejected all views Of the skandhas, sensory bases, and sensory elements as seats of the self.

source: །དེས་ནི་གང་དང་གང་རྣམས་རྒྱལ་བས་སྨད་མཛད་པའི།
en: “Whatever actions have been condemned by the jinas

source: །ལས་དང་ཉོན་མོངས་བཅས་པ་དོན་དུ་མི་འགྱུར་རྣམས།
en: As nonbeneficial and accompanied by the kleśas

source: །དེ་དག་ཡོངས་སུ་སྤངས་ཤིང་མཁས་པ་ཁོང་ནས་དག །འགྲོ་བ་བསྐྱབ་པའི་དོན་དུ་ལས་རབ་དགེ་ལ་བརྩོན།
en: Are rejected by the wise ones, who have pure intentions And are dedicated to the Dharma, good actions, and benefiting beings.

source: །མཁས་པ་དེ་ནི་བྱམས་པའི་སེམས་ལྡན་བག་ཀྱང་ཡོད།
en: “The wise one has a loving mind, is careful,

source: །མཉེན་འཇམ་སེམས་ལྡན་ཕན་དང་བདེ་བྱེད་དྲན་དང་ལྡན།
en: Has a gentle mind, is candid, brings happiness and benefit,

source: །དམ་པའི་དོན་རྣམས་ཐམས་ཅད་སྐྱོན་མེད་ཡོངས་སུ་ཚོལ།
en: Is not afflicted, aspires to higher goals,

source: །ཡེ་ཤེས་དབང་བསྐུར་མངོན་མོས་འགྲོ་བའི་དོན་ཀྱང་བྱས།
en: Desires the consecration of wisdom, and accomplishes the benefit of beings.

source: །བླ་མ་རིམ་གྲོར་བྱེད་དང་ལྡན་ཞིང་ནན་ཏན་བརྩོན།
en: “He has reverence for the gurus,

source: །དྲིན་གཟོ་ཁྲོ་བ་མེད་ཅིང་ང་ལོ་བདེ་དང་ལྡན།
en: Is appreciative, benevolent, guileless,

source: །སྒྱུ་མེད་ཐིབས་པོ་མེད་ཅིང་ཤིན་ཏུ་ངེས་པ་སྟེ།
en: Honest, candid, and reliable,

source: །ཡང་དག་སྒྲུབ་བྱེད་བརྩོན་འགྲུས་ཕྱིར་ལྡོག་མེད་པ་ཡིན།
en: Has unstoppable diligence, and has perfect accomplishment.

source: །ཡིད་དུ་འོང་བའི་ས་འདི་ལ་ནི་དེ་གནས་ཚེ།
en: “When they are on this bhūmi named Brilliance,

source: །ལྷག་པའི་བསམ་པ་ཉིད་དང་བསམ་དག་འཐོབ་པར་འགྱུར།
en: They attain the quality of a pure superior intention,

source: །མོས་པ་རབ་ཏུ་འབྱུང་འགྱུར་དགེ་ཆོས་རྣམ་པར་འཕེལ།
en: Their motivation intensifies and their good qualities multiply,

source: །དྲི་མ་རྙོག་པ་ཐེ་ཙོམ་ཡིད་གཉིས་ཐམས་ཅད་བསྩལ།
en: And the impurity of stains and all equivocation and uncertainty are ended.

source: །འདི་ལ་གནས་པའི་མི་རབ་ཁྱུ་མཆོག་རྒྱལ་བའི་སྲས།
en: “The bodhisattvas, the leaders of men, who are on this bhūmi

source: །བདེ་གཤེགས་བྱེ་བ་དུ་མ་མངོན་པར་མཆོད་པ་བྱེད།
en: Make many millions of offerings to the sugatas.

source: །ཆོས་ཀྱང་ཉན་བྱེད་བསྟན་པ་དེ་ལ་རབ་ཏུ་འབྱུང་།
en: They listen to their teachings and take ordination in them.

source: །རྒྱན་དུ་བྱས་པའི་གསེར་ལྟར་མི་འཕྲོགས་ཐུབ་པ་མེད།
en: Like gold made into jewelry, they cannot be outshone or surpassed. “The wise ones on this bhūmi have qualities, motivation,

source: །མཁས་པ་འདི་ལ་གནས་པའི་ཡོན་ཏན་བསམ་པ་དང་། །ཡེ་ཤེས་ཐབས་དང་སྤྱོད་པ་རྣམ་དག་ལམ་ལ་ཡང་།
en: Wisdom, methods, conduct, and the pure path.

source: །རྣམ་པར་བཟློག་པར་བདུད་རྣམས་བྱེ་བས་མི་ནུས་ཏེ་རིན་ཆེན་འོད་ལ་རླུང་གིས་ཆོད་པར་མི་འགྱུར་བཞིན།
en: Not even millions of māras are able to make them decline, Just as the wind and rain cannot put out the brilliance of a jewel.

source: །མི་དང་ལྷས་མཆོད་འོས་པ་འདི་ལ་གནས་པ་ནི།
en: “Those on this bhūmi are worthy of offerings from humans and deities.

source: །དབང་ཕྱུག་མཚེ་མའི་དམ་པ་ཆོས་ལ་སྤྱད་པར་འགྱུར།
en: They become Lord Suyāma, the sovereign Dharma practitioner.

source: །ལྟ་བའི་ཐིབས་པོ་རྣམས་ལས་སེམས་ཅན་རྣམ་པར་བཟློག །རྒྱལ་བའི་ཡེ་ཤེས་དོན་ཏུ་དགེ་བ་རབ་ཏུ་རྩོམ།
en: They turn beings away from devious views, And they engage in good conduct in order to have the wisdom of the jinas. “Possessing diligence, resting in meditation, thinking of nothing else,

source: །བརྩོན་འགྲུས་ལྡན་པས་མི་ཡི་ཁྱུ་མཆོག་ཁྲག་ཁྲིག་བརྒྱ། །གཞན་དུ་མི་སེམས་ཤིན་ཏུ་མཉམ་པར་གཞག་པས་མཐོང་། །ཡན་ཅད་སྨོན་ལམ་དམ་པ་ཡོན་ཏན་དོན་སྤྱོད་པ།
en: They see a billion leaders of humans.

source: །ཡེ་ཤེས་འབྱུང་གནས་བསྐལ་པ་མང་པོར་མངོན་པར་སྒྲུབ།
en: From then on they practice successfully for many eons. They are the source of wisdom, accomplishing the results of supreme prayers.” In this way the son of the sugatas taught

source: །དེ་ལྟར་ས་མཆོག་བཞི་པ་འདི།
en: This fourth supreme bhūmi,

source: །རྣམ་དག་དག་པའི་སྤྱོད་ལྡན་ཞིང་།
en: Which is pure, has pure conduct,

source: །ཡོན་ཏན་ཡེ་ཤེས་དོན་ལྡན་ལ། །བདེ་བར་གཤེགས་པའི་སྲས་ཀྱིས་བསྟན།
en: And has beneficial qualities and wisdom.

source: །འོད་འཕྲོ་ཅན་ཞེས་བྱ་བ་སྟེ།
en: That which is named Brilliance

source: བྱང་ཆུབ་སེམས་དཔའི་ས་བཞི་པའོ།། །།སངས་རྒྱས་རྨད་ག་ཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། བམ་པོ་བཅུ་དྲུག་པ།
en: Is the fourth bodhisattva bhūmi.

source: །མཁས་པ་རྣམས་ཀྱིས་མཆོག་སྤྱོད་པ་ཐོས་གྱུར་ནས།
en: When the wise ones had heard the practice of this excellent bhūmi,

source: །ཆོས་ཀྱི་ཤེས་པས་རྒྱལ་སྲས་མགུ་ཞིང་དགའ།
en: The jinaputras were pleased and happy because of the Dharma.

source: །དགའ་བའི་ཡིད་ཀྱིས་མཁའ་ལས་མེ་ཏོག་ཆར་ཡང་འབེབས།
en: The delighted ones in the sky threw down a rain of flowers And proclaimed, “Excellent!

source: །བདག་ཉིད་ཆེ་བའི་བདེ་གཤེགས་སྲས་པོ་དགེ་ཞེས་བརྗོད།
en: Sugataputra, you are a great being.”

source: །ལྷ་ཡི་བདག་པོ་དབང་སྒྱུར་ལྷ་ཡི་ཚོགས་རྣམས་དང་། །དགའ་བས་མཁའ་ལ་འཕགས་ཏེ་བདེ་གཤེགས་མཆོད་པའི་ཕྱིར།
en: Vaśavartin, lord of the gods, together with a host of devas, Delighted, had come into the sky to make offerings to the Sugata. With joy and devotion, they scattered upon the Sugata

source: །མེ་ཏོག་སྣ་ཚོགས་སྤྲིན་ཆེན་མདོག་སྡུག་ཡིད་འོང་བ།
en: A beautiful, colorful, great cloud of various flowers.

source: །དགའ་ཞིང་མོས་པས་བདེ་བར་གཤེགས་ལ་མངོན་པར་གཏོར། །གླུ་དབྱངས་སྙན་པ་ཡིད་འོང་སིལ་སྙན་རྔ་ཡི་སྒྲ།
en: With beautiful songs, with musical instruments and drums,

source: །ལྷ་ཚོགས་མང་པོས་རྒྱལ་བ་མཆོད་པའི་དོན་དུ་བྱས།
en: A great multitude of devas made an offering to the Jina.

source: །རྒྱལ་བ་དེ་ཚེ་རབ་ཏུ་འཕྲུལ་པའི་སྐུ་ཡང་སྟོན།
en: They gazed upon the Jina’s own body, which was present there,

source: །སྒྲ་དབྱངས་རྣམ་པ་ཀུན་ལས་འདི་འདྲའི་སྒྲ་བྱུང་ངོ་།
en: And these words arose from the beautiful melodies:

source: །ཡུན་རིང་མཆོག་གིས་ཐུབ་པའི་དགོངས་པ་རྫོགས།
en: “After a very long time the Muni’s intention has been fulfilled.

source: །ཡུན་རིང་མཆོག་གིས་ཐུབ་པས་བྱང་ཆུབ་བརྙེས།
en: After a very long time the Jina has attained the peace of enlightenment.

source: །ལྷ་མི་ཕན་པ་ཡུན་རིང་མཆོག་གིས་མཐོང་།
en: After a very long time the benefit of humans and devas has been seen.

source: །ལྷ་ཡི་གནས་སུ་ཤཱཀྱ་ཐུབ་པ་གཤེགས།
en: Śākyamuni has reached the divine city.

source: །ཡུན་རིང་མཆོག་གིས་རྒྱ་མཚོའི་ཆུ་ཡང་གཡོས།
en: “After a very long time the water of the ocean has been shaken.

source: །ཡུན་རིང་མཆོག་གིས་འོད་བཟང་ཐུབ་པས་བཀྱེ།
en: After a very long time the Muni has radiated beautiful light.

source: །ཡུན་རིང་མཆོག་གིས་སེམས་ཅན་བདེ་བར་གྱུར།
en: After a very long time beings have become happy.

source: །ཐུགས་རྗེ་ཆེ་གསུང་ཡུན་རིང་མཆོག་གིས་ཐོས།
en: After a very long time the compassionate teaching has been heard.

source: །ཡུན་རིང་མཆོག་གིས་ཐུབ་པ་ཆེ་དང་ཕྲད།
en: “After a very long time we have met the great Muni.

source: །ཡོན་ཏན་ཀུན་གྱི་མཐར་ཕྱིན་ད་བྱོན་ཏོ།
en: The perfection of all good qualities has been reached.

source: །ང་རྒྱལ་དེགས་སྙེམས་མུན་པ་ཀུན་སྤངས་ཏེ།
en: He has abandoned the darkness of the emotions of pride and arrogance.

source: །མཚུངས་མེད་མཆོད་པར་འོས་ལ་མཆོད་པ་གྱིས།
en: We offer to the great renunciate who is worthy of offering.

source: །དེ་ལ་མཆོད་བྱས་བདེ་འགྲོའི་ལམ་དུ་འགྲོ།
en: “Having offered to him, we will go on the path to happiness.

source: །དེ་ལ་མཆོད་བྱས་བདེ་བ་རྣམ་པ་མང་།
en: Having offered to him, there will be many kinds of happiness.

source: །དེ་ལ་མཆོད་བྱས་སྡུག་བསྔལ་ཐམས་ཅད་འབྱང་།
en: Having offered to him, all suffering will end.

source: །དེ་ལ་མཆོད་བྱས་རྒྱལ་བའི་ཡེ་ཤེས་འཐོབ།
en: Having offered to him, there will be the supreme wisdom of the jinas.

source: །རྒྱལ་བ་མཁའ་ལྟར་རྣམ་པར་དག་པ་སྟེ།
en: “The Jina is completely pure like space,

source: །འགྲོ་བས་མི་གོས་པད་མའི་ཆུ་དང་འདྲ།
en: Unstained in the world like a lotus in water;

source: །ཤིན་ཏུ་འཕགས་པ་རྒྱ་མཚོའི་རི་རབ་བཞིན།
en: He has risen far above, like Sumeru over the ocean.

source: །སྤྲོ་བའི་སེམས་ཀྱིས་རྒྱལ་བ་མཆོད་གྱིས་ཤིག །དེ་སྐད་དབྱངས་སུ་བརྗོད་བྱས་ནས།
en: With joyful minds we make offerings to the Jina.” When they had sung that song,

source: །ལྷ་ཡི་བུ་མོ་བརྒྱ་མང་བ།
en: Many hundreds of deva maidens

source: །དགའ་བས་རྒྱས་པས་རབ་ཏུ་བལྟ།
en: With increased joy looked upon him,

source: །ཤིན་ཏུ་དགའ་བས་རིམ་གྲོ་བྱེད།
en: And with great joy they honored him.

source: །དེ་ནས་རྡོ་རྗེའི་སྙིང་པོ་ལ།
en: Then Vimukti­candra

source: །རྣམ་ཐར་ཟླ་བས་སྨྲས་པ་ནི།
en: Said to Vajra­garbha, “Jinaputra, describe to us

source: །ས་ལྔའི་རྣམ་པ་ཅི་འདྲ་བ། །རྒྱལ་བའི་སྲས་ཀྱིས་བཤད་པར་མཛོད།
en: The nature of the fifth bhūmi.”

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་ས་བཞི་པ་ལ་སའི་ལམ་ཡོངས་སུ་རྫོགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ས་ལྔ་པ་ལ་འཇུག་སྟེ།
en: The bodhisattva who has completed the path of the fourth bodhisattva bhūmi enters the fifth bodhisattva bhūmi.

source: དེ་སེམས་ཀྱི་བསམ་པ་རྣམ་པར་དག་པའི་མཉམ་པ་ཉིད་བཅུས་འཇུག་གོ །བཅུ་གང་ཞེ་ན་འདི་ལྟ་སྟེ།
en: He enters it through ten kinds of sameness of the mind’s thoughts on purity. What are these ten? They are these:

source: འདས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱིས་བསམ་པ་རྣམ་པར་དག་པ་མཉམ་པ་ཉིད་དང་། མ་བྱོན་པའི་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱིས་བསམ་པ་རྣམ་པར་དག་པ་མཉམ་པ་ཉིད་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱིས་བསམ་པ་རྣམ་པར་དག་པ་མཉམ་པ་ཉིད་དང་། ཚུལ་ཁྲིམས་ཀྱིས་བསམ་པ་རྣམ་པར་དག་པ་མཉམ་པ་ཉིད་དང་། སེམས་ཀྱིས་བསམ་པ་རྣམ་པར་དག་པ་མཉམ་པ་ཉིད་དང་། ལྟ་བ་དང་ནེམ་ནུར་དང་དོགས་པ་བསྩལ་བས་བསམ་པ་རྣམ་པར་དག་པ་མཉམ་པ་ཉིད་དང་། ལམ་དང་ལམ་མ་ཡིན་པ་ཤེས་པས་བསམ་པ་རྣམ་པར་དག་པ་མཉམ་པ་ཉིད་དང་། ནན་ཏན་དང་སྤོང་བ་ཤེས་པས་བསམ་པ་རྣམ་པར་དག་པ་མཉམ་པ་ཉིད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཐམས་ཅད་གོང་ནས་གོང་དུ་རྣམ་པར་སྒོམ་པས་བསམ་པ་རྣམ་པར་དག་པ་མཉམ་པ་ཉིད་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བས་བསམ་པ་རྣམ་པར་དག་པ་མཉམ་པ་ཉིད་དེ།
en: (1) the sameness of thoughts of the pure qualities of the buddhas of the past; ( ) the sameness of thoughts of the pure qualities of the buddhas of the future; (3) the sameness of thoughts of the pure qualities of the buddhas of the present; (4) the sameness of thoughts of the purity of correct conduct; (5) the sameness of thoughts of the purity of mind; (6) the sameness of thoughts of the purity of eliminating views, uncertainty, doubt, and regret; (7) the sameness of thoughts of the purity of knowing what is the path and what is not the path; (8) the sameness of thoughts of the purity of knowing diligence and rejection; (9) the sameness of thoughts of the purity of the increasing development of all the factors for enlightenment; and (10) the sameness of thoughts of the purity of completely ripening all beings.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །སེམས་ཀྱི་བསམ་པ་རྣམ་པར་དག་པ་བཅུ་པོ་འདི་དག་གིས་དེ་ལ་འཇུག་སྟེ།
en: “O jinaputras, it is through these ten qualities of the mind’s thoughts on purity that they enter it.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །བྱང་ཆུབ་སེམས་དཔའི་ས་ལྔ་པ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་དང་ལམ་གྱི་ཡན་ལག་དེ་དག་ཉིད་ལ་སྦྱང་བ་ཤིན་ཏུ་བྱས་ཤིང་།
en: “O jinaputras, the bodhisattva who has reached the fifth bodhisattva bhūmi has accomplished those factors for enlightenment, those aspects of the path, and has a purified higher motivation.

source: ལྷག་པའི་བསམ་པ་ཤིན་ཏུ་སྦྱངས་པས་དེའི་གོང་དུ་ལམ་གྱི་ཁྱད་པར་ཚོལ་ཞིང་དེ་བཞིན་ཉིད་ཀྱི་རྗེས་སུ་ཞུགས་པ་དང་། སྨོན་ལམ་གྱི་མཐུ་དང་། ཤུགས་དང་སྙིང་རྗེ་དང་། བྱམས་པས་སེམས་ཅན་ཡོངས་སུ་མི་གཏོང་བ་དང་། བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་རབ་ཏུ་བསྩགས་པ་དང་། ཡོངས་སུ་རྒྱུན་འཆད་པ་མེད་པ་དང་། ཐབས་ལ་མཁས་པས་མངོན་པར་སྒྲུབ་པ་དང་། གོང་ནས་གོང་དུ་སའི་སྣང་བ་བལྟ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་བཙལ་བ་དང་། དྲན་པ་དང་བློ་གྲོས་དང་། རིག་པ་དང་། བློའི་སྟོབས་དང་། ཤུགས་ཀྱིས་ཡིད་ལ་བྱ་བའི་ཕྱིར་མི་ཟློག་པར་བྱས་ཏེ། འདི་ནི་སྡུག་བསྔལ་འཕགས་པའི་བདེན་པ་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །འདི་ནི་སྡུག་བསྔལ་ཀུན་འབྱུང་བ།
en: “Therefore he (1) aspires to the subsequent superior path, ( ) follows the true nature, (3) establishes the power of prayer, (4) through compassion and love does not abandon any being, (5) has gathered the accumulations of merit and wisdom, (6) is unceasing, (7) has accomplished skill in methods, (8) is focused on the splendor of the higher and higher bhūmis, (9) has received the blessing of the tathāgatas, and (10) through the development of the power of mindfulness, understanding, and discernment has unimpeded attention.

source: འདི་ནི་སྡུག་བསྔལ་ཀུན་འགོག་པ།
en: “He knows completely the noble truth of suffering.

source: འདི་ནི་སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་འཕགས་པའི་བདེན་པ་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ། དེ་ཀུན་རྫོབ་ཀྱི་བདེན་པ་ལ་མཁས་པ་ཡིན། དོན་དམ་པའི་བདེན་པ་ལ་མཁས་པ་ཡིན། མཚན་ཉིད་ཀྱི་བདེན་པ་ལ་མཁས་པ་ཡིན། རྣམ་པར་དབྱེ་བའི་བདེན་པ་ལ་མཁས་པ་ཡིན། བརྟག་པའི་བདེན་པ་ལ་མཁས་པ་ཡིན།
en: He knows completely the noble truths of the origin of suffering, the cessation of suffering, and the path that leads to the cessation of suffering.

source: དངོས་པོའི་བདེན་པ་ལ་མཁས་པ་ཡིན། འབྱུང་བའི་བདེན་པ་ལ་མཁས་པ་ཡིན། བྱང་ཞིང་མི་སྐྱེ་བའི་བདེན་པ་ལ་མཁས་པ་ཡིན། ལམ་གྱི་ཡེ་ཤེས་ལ་འཇུག་པའི་བདེན་པ་ལ་མཁས་པ་ཡིན། བྱང་ཆུབ་སེམས་དཔའི་སའི་རིམ་པ་མཚམས་སྦྱར་བ་བསྒྲུབ་པར་བྱ་བས་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཡང་དག་པར་བསྐྱེད་པའི་བར་དུ་མཁས་པ་ཡིན་ཏེ།
en: “(1) He is wise in relative truth, ( ) he is wise in ultimate truth, (3) he is wise in the truth of characteristics, (4) he is wise in the truth of classification, (5) he is wise in the truth of accomplishment, (6) he is wise in the truth of things, (7) he is wise in the truth of generation, (8) he is wise in the truth of termination and nonarising, (9) he is wise in the truth of entering the wisdom of the path, and (10) he is also wise in developing the wisdom of the tathāgatas through accomplishing the transition between the stages of all bodhisattva bhūmis.

source: དེ་སེམས་ཅན་གཞན་དང་གང་ཟག་གཞན་ལ་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤིན་ཏུ་དགའ་བར་བྱེད་པས་ཀུན་རྫོབ་ཀྱི་བདེན་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: “(1) He makes other beings and other individuals happy according to their wishes and therefore knows relative truth perfectly.

source: །ཐེག་པ་གཅིག་ཏུ་ཡང་དག་པར་གཞོལ་བས་དོན་དམ་པའི་བདེན་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: ) He gathers all into one way and therefore knows ultimate truth perfectly.

source: །ཆོས་ཀྱི་རང་གི་མཚན་ཉིད་ཁོང་དུ་ཆུད་པས་མཚན་ཉིད་ཀྱི་བདེན་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: (3) He has comprehended the individual characteristics of phenomena and therefore knows the truth of characteristics perfectly.

source: །ཆོས་ཀྱི་བྱེ་བྲག་རྣམ་པར་དགོད་པ་ཁོང་དུ་ཆུད་པས་རྣམ་པར་དབྱེ་བའི་བདེན་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: (4) He has comprehended the distinct categories of phenomena and therefore knows the truth of classification perfectly.

source: །ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་རྣམ་པར་དགོད་པས་རྟོག་པའི་བདེན་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: (5) He has comprehended the distinctions of skandhas, sensory elements, and sensory bases and therefore knows the truth of accomplishment perfectly.

source: །ལུས་དང་སེམས་ལ་གནོད་པ་ཉམས་སུ་འབབ་པས་དངོས་པོའི་བདེན་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: (6) Through unveiling the kleśas of mind and body he knows the truth of things perfectly.

source: །འགྲོ་བའི་རྒྱུད་ཀྱི་མཚམས་སྦྱོར་བས་འབྱུང་བའི་བདེན་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: (7) Through the connections of transition between existences he knows the truth of generation perfectly.

source: །རིམས་དང་ཡོངས་སུ་གདུང་བ་ཐམས་ཅད་ཤིན་ཏུ་ཞི་བས་བྱང་ཞིང་མི་སྐྱ་བའི་བདེན་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: (8) Through the pacification of all disease and pain he knows the truth of termination and nonarising perfectly.

source: །མི་གཉིས་པས་མངོན་པར་བསྒྲུབ་པས་ལམ་གྱི་ཡེ་ཤེས་ལ་འཇུག་པའི་བདེན་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: (9) Through the accomplishment of nonduality he knows the truth of entering the wisdom of the path perfectly.

source: །རྣམ་པ་ཐམས་ཅད་དུ་མངོན་པར་འཚང་རྒྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སའི་རིམ་པ་ཐམས་ཅད་མཚམས་སྦྱོར་བ་རབ་ཏུ་བསྒྲུབ་པས་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཡང་དག་པར་འབྱུང་བའི་བདེན་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: (10) Through becoming enlightened in all aspects and through accomplishing the transitions between the stages of all bodhisattva bhūmis he knows the truth of developing the wisdom of the tathāgatas perfectly.

source: །དེ་འང་མོས་པས་ཤེས་པའི་སྟོབས་དང་ཤུགས་ཀྱིས་ཏེ་ལྷག་མ་མ་ལུས་པར་ཡེ་ཤེས་ཁོང་དུ་ཆུད་པས་ནི་མ་ཡིན་ནོ། །དེ་དེ་ལྟར་བདེན་པ་ལ་མཁས་པ།
en: “This is from possessing the power of wisdom through aspiration, and not from complete wisdom.

source: མངོན་པར་བསྒྲུབ་པའི་བློས་འདུས་བྱས་ཐམས་ཅད་གསོབ་གསོག་བརྫུན་པ་བསླུ་བའི་ཆོས་ཅན་དཀུ་བྱེད་པ། བྱིས་པ་འདྲིད་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: “Through this realization, this attaining the wisdom that is wise in truth, he perfectly knows that all that is composite is nothing but hollow, worthless, false, unreliable, and that which deceives fools.

source: དེ་སྔོན་བས་ཀྱང་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་མངོན་དུ་འགྱུར་རོ།
en: With increased compassion for beings he manifests compassion toward all beings.

source: །བྱམས་པ་ཆེན་པོའི་སྣང་བ་ཡང་རབ་ཏུ་འབྱུང་སྟེ།
en: He regards beings with compassion even more than before, and the light of his great love shines.

source: དེ་དེ་ལྟར་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་ཤུགས་རབ་ཏུ་ཐོབ་ཅིང་སེམས་ཅན་ཐམས་ཅད་ལ་ལྟ་བ་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ལ་མངོན་པར་མོས་པས་འདུ་བྱེད་ཀྱི་རྣམ་པ་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་རབ་ཏུ་རྟོག་སྟེ།
en: “He has thus gained possession of the power of wisdom, regards all beings, and wishes for the wisdom of buddhahood. He examines all the mental activities concerning the past and the future.

source: འདི་ལྟར་སྔོན་གྱི་མཐའི་མ་རིག་པ་དང་། སྲིད་པ་དང་སྲེད་པ་ལས་རབ་ཏུ་བྱུང་བའི་སེམས་ཅན་འཁོར་བའི་རྒྱུད་དུ་འབབ་པ། ཕུང་པོའི་གནས་ལས་མ་འཕགས་པ། སྡུག་བསྔལ་གྱི་ཕུང་པོ་བདག་མེད་པ། སེམས་ཅན་མེད་པ།
en: He perfectly knows that it is from past ignorance, becoming, and craving that there has arisen the river of saṃsāra in which beings are swept along, in which they do not transcend the dwelling of the skandhas, and in which there has arisen an increasing mass of suffering.

source: སྲོག་མེད་པ། གསོ་བ་མེད་པ། གང་ཟག་མེད་པ། བདག་དང་བདག་གི་དང་བྲལ་བ་རྣམ་པར་འཕེལ་ལོ། །ཞེས་དེ་འང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: He knows that this has no self, no being, no soul, no spirit, no person, and the absence of anything that belongs to a self.

source: །འདི་ལྟར་ཕྱི་མའི་མཐའི་མེད་པ་ལ་རྨོངས་པའི་འདོད་པ་འདི་ཉིད་རྒྱུན་གཅོད་པ་དང་མཐར་དབྱུང་བ་དང་། འབྱུང་བར་བྱ་བ་དང་། ཡོད་པ་དང་མེད་པ་དེ་ཡང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: In that way he also knows perfectly whether in the future there will or will not be a cessation, an end, and a release from this ignorant longing for the nonexistent.

source: དེ་འདི་སྙམ་དུ་སེམས་སོ།
en: “He is astonished that childlike ordinary beings are so ignorant and foolish in this way. They have had countless bodies that have been destroyed, are being destroyed, and will be destroyed, but they do not feel revulsion toward these perishing bodies.

source: །དེ་ལྟར་ལུས་གྲངས་མེད་པ་ཞིག་འགགས་ལ་འགག་པར་འགྱུར་ཞིང་འགག་བཞིན་ཏེ།
en: They greatly increase the machines of torture. They do not stop the rivers of saṃsāra. They do not reject the dwelling of the skandhas. They are not revolted by the serpents of the elements of perception.

source: འདི་ལྟར་རྒུད་པར་འགྱུར་ཡང་ལུས་ལ་སྐྱོ་བ་མི་སྐྱེད་ཅིང་སྡུག་བསྔལ་གྱི་འཁྲུལ་འཁོར་ཇེ་བས་ཇེ་འཕེལ་དུ་བྱེད་པ་དང་། འཁོར་བའི་རྒྱུད་ལས་ཕྱིར་མི་ལྡོག་ཅིང་ཕུང་པོའི་གནས་མི་གཏོང་བ་དང་། ཁམས་ཀྱི་སྦྲུལ་གྱིས་སྐྱོ་བར་མི་འགྱུར་བ་དང་། ང་རྒྱལ་དང་ལྟ་བའི་ཟུག་རྔུ་མི་འབྱིན་ཅིང་འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་གི་མེ་ལྕེ་འབར་བ་ཞི་བར་མི་བྱེད་པ་དང་། མ་རིག་པའི་མུན་པ་ཆེན་པོ་མི་སེལ་ཅིང་སྲིད་པའི་མཚོ་མི་སྐེམ་ལ་སྟོབས་བཅུའི་དེད་དཔོན་མི་ཚོལ་ཞིང་བདུད་ཀྱི་བསམ་པ་ཐིབས་པོའི་རྗེས་སུ་སོང་སྟེ་འཁོར་བའི་རྒྱ་མཚོ་རྣམ་པར་རྟོག་པ་སྣ་ཚོགས་ཀྱི་ཆུ་སྲིན་གྱིས་དཀྲུགས་པས་ཡོངས་སུ་གཡེང་བར་འཁོད་ཅིང་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་དེ་དག་དེ་ལྟར་མི་ཤེས་ཤིང་རྨོངས་པ་ནི་ངོ་མཚར་ཆེས་མ་ལ་བདག་གིས་སེམས་ཅན་དེ་ལྟར་སྡུག་བསྔལ་གྱིས་མནར་བ།
en: They do not pull out the painful splinter of arrogant wrong view. They do not extinguish the flames of desire, anger, and ignorance. They do not dispel the darkness of ignorance. They do not dry up the ocean of craving. They do not seek out the caravan leader who is the ten strengths. They are drawn into the dark forests of the thoughts of Māra and are tossed around in the ocean of saṃsāra, the abode of the sea monsters of all kinds of bad thoughts. He thinks, ‘Those beings are thus afflicted by suffering;

source: མགོན་མེད་པ། དཔུང་གཉེན་མེད་པ། སྐྱབས་མེད་པ། གནས་མེད་པ། གཞི་མེད་པ།
en: they have no savior, no protector, no refuge, no reliance, no foundation, and no basis;

source: རྟེན་མེད་པ། ལོང་བར་གྱུར་པ། མ་རིག་པའི་སྒོ་ངའི་སྦུབས་དང་། བྲིས་ཡོག་པ།
en: they are blind, within the egg of ignorance, and enclosed in darkness.

source: མུན་པས་ཁེབས་པ་དེ་དག་གི་དོན་དུ་བདག་གཅིག་པུ་གཉིས་སུ་མེད་པས་བསོད་ནམས་དང་། ཡེ་ཤེས་ཀྱི་ཚོགས་ཀྱི་རྣམ་པར་བསྩགས་པར་བྱ་བ་ཇི་ལྟ་བུར་བསྩགས་པས་སེམས་ཅན་དེ་དག་ཤིན་ཏུ་རྣམ་པར་དག་པ་འཐོབ་པར་འགྱུར་བ་དང་། སྟོབས་བཅུའི་སྟོབས་ཀྱི་ཡེ་ཤེས་ཆགས་པ་མེད་པའི་བར་གྱི་མཐར་ཐུག་པ་ཐོབ་པར་འགྱུར་བའི་རྣམ་པ་དེ་ལྟ་བུའི་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་བསྩགས་པར་བྱ་འམ་ཅི་སྙམ་སྟེ།
en: For them, I alone, with no other, will gather the accumulations of merit and wisdom so that through that correct accumulation of merit and wisdom those beings will attain complete purity and so on, until attaining the unimpeded wisdom of the ten strengths.’

source: དེ་དེ་ལྟར་ཤིན་ཏུ་བརྟགས་པའི་ཡེ་ཤེས་ཀྱིས་མངོན་པར་བསྒྲུབ་པའི་བློས་དགེ་བའི་རྩ་བ་གང་ཅི་རྩོམ་ཡང་དེ་དག་ཐམས་ཅད་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་བདེ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་བརྩེ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་གཙེ་བ་མེད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་དགྲོལ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་དྲང་བ་དང་། སེམས་ཅན་ཐམས་ཅད་དད་པར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་གདུལ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བའི་ཕྱིར་རབ་ཏུ་རྩོམ་སྟེ།
en: “Whatever roots of goodness he undertakes, with an understanding that is attained by knowledge through examination, he undertakes them for the protection of all beings, for the benefit of all beings, for the happiness of all beings, for kindness to all beings, for there being no misfortune for all beings, for the liberation of all beings, for leading all beings, for developing faith within all beings, for taming all beings, and for the nirvāṇa of all beings.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་ལྔ་པ་ཤིན་ཏུ་རྒྱལ་བར་དཀའ་བ་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི། དེ་བས་ཀྱང་ཉམས་པར་མི་འགྱུར་བའི་ཆོས་ཉིད་ཀྱིས་དྲན་པ་དང་ལྡན་པ་ཡིན།
en: “The bodhisattva who dwells on this fifth bodhisattva bhūmi, called Difficult to Conquer, has memory because he has the quality of never forgetting;

source: ཤིན་ཏུ་ངེས་པར་རྟོགས་པའི་ཡེ་ཤེས་ཀྱི་བློ་གྲོས་དང་ལྡན་པ་ཡིན།
en: he has intelligence because of the certainty of his wisdom;

source: མདོའི་དོན་དང་ཚུལ་དང་ལྡེམ་པོའི་ངག་ཁོང་དུ་ཆུད་པས་རིག་པ་དང་ལྡན་པ་ཡིན།
en: he has knowledge because he understands the underlying meaning taught in the sūtras;
